name: "GoogleNet"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim:1  dim: 3 dim: 160 dim: 160 } }

}
layer {
  name: "InceptionResnetV1/Conv2d_1a_3x3/Conv2D"
  type: "Convolution"
  bottom: "data"
  top: "InceptionResnetV1/Conv2d_1a_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Conv2d_1a_3x3/Conv2D"
  top: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "conv_3x3_1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm"
  top: "conv_3x3_1_relu"
}

layer {
  name: "InceptionResnetV1/Conv2d_2a_3x3/Conv2D"
  type: "Convolution"
  bottom: "conv_3x3_1_relu"
  top: "InceptionResnetV1/Conv2d_2a_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Conv2d_2a_3x3/Conv2D"
  top: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "conv_3x3_2_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Conv2d_2a_3x3/BatchNorm/FusedBatchNorm"
  top: "conv_3x3_2_relu"
}

layer {
  name: "InceptionResnetV1/Conv2d_2b_3x3/Conv2D"
  type: "Convolution"
  bottom: "conv_3x3_2_relu"
  top: "InceptionResnetV1/Conv2d_2b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Conv2d_2b_3x3/Conv2D"
  top: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "conv_3x3_3_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Conv2d_2b_3x3/BatchNorm/FusedBatchNorm"
  top: "conv_3x3_3_relu"
}


layer {
  name: "pool/3x3"
  type: "Pooling"
  bottom: "conv_3x3_3_relu"
  top: "pool/3x3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "InceptionResnetV1/Conv2d_3b_1x1/Conv2D"
  type: "Convolution"
  bottom: "pool/3x3"
  top: "InceptionResnetV1/Conv2d_3b_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 80
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Conv2d_3b_1x1/Conv2D"
  top: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "conv_3x3_4_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Conv2d_3b_1x1/BatchNorm/FusedBatchNorm"
  top: "conv_3x3_4_relu"
}

layer {
  name: "InceptionResnetV1/Conv2d_4a_3x3/Conv2D"
  type: "Convolution"
  bottom: "conv_3x3_4_relu"
  top: "InceptionResnetV1/Conv2d_4a_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 192
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Conv2d_4a_3x3/Conv2D"
  top: "InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "conv_3x3_5_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Conv2d_4a_3x3/BatchNorm/FusedBatchNorm"
  top: "conv_3x3_5_relu"
}

layer {
  name: "InceptionResnetV1/Conv2d_4b_3x3/Conv2D"
  type: "Convolution"
  bottom: "conv_3x3_5_relu"
  top: "InceptionResnetV1/Conv2d_4b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Conv2d_4b_3x3/Conv2D"
  top: "InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "conv_3x3_6_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Conv2d_4b_3x3/BatchNorm/FusedBatchNorm"
  top: "conv_3x3_6_relu"
}



#Inception A1
layer {
  name: "InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "conv_3x3_6_relu"
  top: "InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA1_1_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_1/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  top: "convA1_1_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "conv_3x3_6_relu"
  top: "InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }

  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA1_2_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  top: "convA1_2_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA1_2_1x1_relu"
  top: "InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA1_2_3x3_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  top: "convA1_2_3x3_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "conv_3x3_6_relu"
  top: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA1_3_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  top: "convA1_3_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA1_3_1x1_relu"
  top: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA1_3_3x3_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  top: "convA1_3_3x3_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA1_3_3x3_relu"
  top: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA1_3_3x3_1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  top: "convA1_3_3x3_1_relu"
}


layer {
  name: "inception_A1/output"
  type: "Concat"
  bottom: "convA1_1_1x1_relu"
  bottom: "convA1_2_3x3_relu"
  bottom: "convA1_3_3x3_1_relu"
  top: "inception_A1/output"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_1/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "inception_A1/output"
  top: "InceptionResnetV1/Repeat/block35_1/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer{
     name: "BiasA1"
     type: "Bias"
     bottom: "InceptionResnetV1/Repeat/block35_1/Conv2d_1x1/Conv2D"
     top: "BiasA1"
     }

layer{
  name: "Mult1"
  type: "Power"
  bottom: "BiasA1"
  top: "Mult1"
  power_param {
    power: 1
    scale: 0.17000
    shift: 0
  }
}

layer {
  name: "ADD1"
  type: "Eltwise"
  bottom: "Mult1"
  bottom: "conv_3x3_6_relu"
  top: "ADD1"
  eltwise_param {
   operation: SUM 
}
}

layer {
  name: "IncepA1_relu"
  type: "ReLU"
  bottom: "ADD1"
  top: "IncepA1_relu"
}




#Inception A2
layer {
  name: "InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA1_relu"
  top: "InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA2_1_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_2/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  top: "convA2_1_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA1_relu"
  top: "InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }

  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA2_2_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  top: "convA2_2_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA2_2_1x1_relu"
  top: "InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA2_2_3x3_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  top: "convA2_2_3x3_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA1_relu"
  top: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA2_3_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  top: "convA2_3_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0b_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA2_3_1x1_relu"
  top: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0b_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA2_3_3x3_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  top: "convA2_3_3x3_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0c_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA2_3_3x3_relu"
  top: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0c_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0c_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA2_3_3x3_1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_2/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  top: "convA2_3_3x3_1_relu"
}


layer {
  name: "inception_A2/output"
  type: "Concat"
  bottom: "convA2_1_1x1_relu"
  bottom: "convA2_2_3x3_relu"
  bottom: "convA2_3_3x3_1_relu"
  top: "inception_A2/output"
  concat_param{
  axis : 1
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_2/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "inception_A2/output"
  top: "InceptionResnetV1/Repeat/block35_2/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer{
     name: "BiasA2"
     type: "Bias"
     bottom: "InceptionResnetV1/Repeat/block35_2/Conv2d_1x1/Conv2D"
     top: "BiasA2"
     }



layer{
  name: "Mult2"
  type: "Power"
  bottom: "BiasA2"
  top: "Mult2"
  power_param {
    power: 1
    scale: 0.17000
    shift:0
  }
}

layer {
  name: "ADD2"
  type: "Eltwise"
  bottom: "Mult2"
  bottom: "IncepA1_relu"
  top: "ADD2"
  eltwise_param {
   operation: SUM 
}
}

layer {
  name: "IncepA2_relu"
  type: "ReLU"
  bottom: "ADD2"
  top: "IncepA2_relu"
}





#inception A3

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Branch_0/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA2_relu"
  top: "InceptionResnetV1/Repeat/block35_3/Branch_0/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_3/Branch_0/Conv2d_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_3/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA3_1_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_3/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  top: "convA3_1_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA2_relu"
  top: "InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }

  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0a_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA3_2_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  top: "convA3_2_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0b_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA3_2_1x1_relu"
  top: "InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0b_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA3_2_3x3_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_3/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  top: "convA3_2_3x3_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA2_relu"
  top: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0a_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA3_3_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  top: "convA3_3_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0b_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA3_3_1x1_relu"
  top: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0b_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA3_3_3x3_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  top: "convA3_3_3x3_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0c_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA3_3_3x3_relu"
  top: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0c_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0c_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA3_3_3x3_1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_3/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  top: "convA3_3_3x3_1_relu"
}


layer {
  name: "inception_A3/output"
  type: "Concat"
  bottom: "convA3_1_1x1_relu"
  bottom: "convA3_2_3x3_relu"
  bottom: "convA3_3_3x3_1_relu"
  top: "inception_A3/output"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_3/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "inception_A3/output"
  top: "InceptionResnetV1/Repeat/block35_3/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer{
     name: "BiasA3"
     type: "Bias"
     bottom: "InceptionResnetV1/Repeat/block35_3/Conv2d_1x1/Conv2D"
     top: "BiasA3"
     }


layer{
  name: "Mult3"
  type: "Power"
  bottom: "BiasA3"
  top: "Mult3"
  power_param {
    power: 1
    scale: 0.17000
    shift: 0
  }
}

layer {
  name: "ADD3"
  type: "Eltwise"
  bottom: "Mult3"
  bottom: "IncepA2_relu"
  top: "ADD3"
  eltwise_param {
   operation: SUM 
}
}

layer {
  name: "IncepA3_relu"
  type: "ReLU"
  bottom: "ADD3"
  top: "IncepA3_relu"
}




#Inception A4
layer {
  name: "InceptionResnetV1/Repeat/block35_4/Branch_0/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA3_relu"
  top: "InceptionResnetV1/Repeat/block35_4/Branch_0/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_4/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_4/Branch_0/Conv2d_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_4/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA4_1_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_4/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  top: "convA4_1_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA3_relu"
  top: "InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }

  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0a_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA4_2_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  top: "convA4_2_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0b_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA4_2_1x1_relu"
  top: "InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0b_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA4_2_3x3_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_4/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  top: "convA4_2_3x3_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA3_relu"
  top: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0a_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA4_3_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  top: "convA4_3_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0b_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA4_3_1x1_relu"
  top: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0b_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA4_3_3x3_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  top: "convA4_3_3x3_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0c_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA4_3_3x3_relu"
  top: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0c_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0c_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA4_3_3x3_1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_4/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  top: "convA4_3_3x3_1_relu"
}


layer {
  name: "inception_A4/output"
  type: "Concat"
  bottom: "convA4_1_1x1_relu"
  bottom: "convA4_2_3x3_relu"
  bottom: "convA4_3_3x3_1_relu"
  top: "inception_A4/output"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_4/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "inception_A4/output"
  top: "InceptionResnetV1/Repeat/block35_4/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer{
     name: "BiasA4"
     type: "Bias"
     bottom: "InceptionResnetV1/Repeat/block35_4/Conv2d_1x1/Conv2D"
     top: "BiasA4"
     }



layer{
  name: "Mult4"
  type: "Power"
  bottom: "BiasA4"
  top: "Mult4"
  power_param {
    power: 1
    scale: 0.17000
    shift: 0
  }
}

layer {
  name: "ADD4"
  type: "Eltwise"
  bottom: "Mult4"
  bottom: "IncepA3_relu"
  top: "ADD4"
  eltwise_param {
   operation: SUM 
}
}

layer {
  name: "IncepA4_relu"
  type: "ReLU"
  bottom: "ADD4"
  top: "IncepA4_relu"
}

#inception A5

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Branch_0/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA4_relu"
  top: "InceptionResnetV1/Repeat/block35_5/Branch_0/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_5/Branch_0/Conv2d_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_5/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA5_1_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_5/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  top: "convA5_1_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA4_relu"
  top: "InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }

  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0a_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA5_2_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  top: "convA5_2_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0b_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA5_2_1x1_relu"
  top: "InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0b_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA5_2_3x3_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_5/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  top: "convA5_2_3x3_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA4_relu"
  top: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0a_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA5_3_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  top: "convA5_3_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0b_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA5_3_1x1_relu"
  top: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0b_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA5_3_3x3_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  top: "convA5_3_3x3_relu"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0c_3x3/Conv2D"
  type: "Convolution"
  bottom: "convA5_3_3x3_relu"
  top: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0c_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0c_3x3/Conv2D"
  top: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convA5_3_3x3_1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat/block35_5/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm"
  top: "convA5_3_3x3_1_relu"
}


layer {
  name: "inception_A5/output"
  type: "Concat"
  bottom: "convA5_1_1x1_relu"
  bottom: "convA5_2_3x3_relu"
  bottom: "convA5_3_3x3_1_relu"
  top: "inception_A5/output"
}

layer {
  name: "InceptionResnetV1/Repeat/block35_5/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "inception_A5/output"
  top: "InceptionResnetV1/Repeat/block35_5/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer{
     name: "BiasA5"
     type: "Bias"
     bottom: "InceptionResnetV1/Repeat/block35_5/Conv2d_1x1/Conv2D"
     top: "BiasA5"
     }

layer{
  name: "Mult5"
  type: "Power"
  bottom: "BiasA5"
  top: "Mult5"
  power_param {
    power: 1
    scale: 0.17000
    shift: 0
  }
}

layer {
  name: "ADD5"
  type: "Eltwise"
  bottom: "Mult5"
  bottom: "IncepA4_relu"
  top: "ADD5"
  eltwise_param {
   operation: SUM 
}
}

layer {
  name: "IncepA5_relu"
  type: "ReLU"
  bottom: "ADD5"
  top: "IncepA5_relu"
}


#Reduce grid into 17X17

layer {
  name: "InceptionResnetV1/Mixed_6a/Branch_0/Conv2d_1a_3x3/Conv2D"
  type: "Convolution"
  bottom: "IncepA5_relu"
  top: "InceptionResnetV1/Mixed_6a/Branch_0/Conv2d_1a_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 384
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Mixed_6a/Branch_0/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Mixed_6a/Branch_0/Conv2d_1a_3x3/Conv2D"
  top: "InceptionResnetV1/Mixed_6a/Branch_0/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "conv1_3x3_reduce_35_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Mixed_6a/Branch_0/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm"
  top: "conv1_3x3_reduce_35_relu"
}

layer {
  name: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "IncepA5_relu"
  top: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 192
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0a_1x1/Conv2D"
  top: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "conv2_1x1_reduce_35_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  top: "conv2_1x1_reduce_35_relu"
}


layer {
  name: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0b_3x3/Conv2D"
  type: "Convolution"
  bottom: "conv2_1x1_reduce_35_relu"
  top: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0b_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0b_3x3/Conv2D"
  top: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "conv2_3x3_reduce_35_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm"
  top: "conv2_3x3_reduce_35_relu"
}

layer {
  name: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_1a_3x3/Conv2D"
  type: "Convolution"
  bottom: "conv2_3x3_reduce_35_relu"
  top: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_1a_3x3/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 256
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_1a_3x3/Conv2D"
  top: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "conv2_3x3_reduce_35_relu_1"
  type: "ReLU"
  bottom: "InceptionResnetV1/Mixed_6a/Branch_1/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm"
  top: "conv2_3x3_reduce_35_relu_1"
}



layer {
  name: "pool/3x3/1"
  type: "Pooling"
  bottom: "IncepA5_relu"
  top: "pool/3x3/1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "grid_17x17"
  type: "Concat"
  bottom: "conv1_3x3_reduce_35_relu"
  bottom: "conv2_3x3_reduce_35_relu_1"
  bottom: "pool/3x3/1"
  top: "grid_17x17"
}

#Inception B1

layer {
  name: "InceptionResnetV1/Repeat_1/block17_1/Branch_0/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "grid_17x17"
  top: "InceptionResnetV1/Repeat_1/block17_1/Branch_0/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat_1/block17_1/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat_1/block17_1/Branch_0/Conv2d_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat_1/block17_1/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convB1_1_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat_1/block17_1/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  top: "convB1_1_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "grid_17x17"
  top: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0a_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convB1_2_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm"
  top: "convB1_2_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0b_1x7/Conv2D"
  type: "Convolution"
  bottom: "convB1_2_1x1_relu"
  top: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0b_1x7/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 128
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
   pad_h: 0
   pad_w: 3
   kernel_h: 1
   kernel_w: 7 
  }
}

layer {
  name: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0b_1x7/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0b_1x7/Conv2D"
  top: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0b_1x7/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convB1_2_1x7_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0b_1x7/BatchNorm/FusedBatchNorm"
  top: "convB1_2_1x7_relu"
}

layer {
  name: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0c_7x1/Conv2D"
  type: "Convolution"
  bottom: "convB1_2_1x7_relu"
  top: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0c_7x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 128
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
   pad_h: 3
   pad_w: 0
   kernel_h: 7
   kernel_w: 1 
  }
}

layer {
  name: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0c_7x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0c_7x1/Conv2D"
  top: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0c_7x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convB1_2_7x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat_1/block17_1/Branch_1/Conv2d_0c_7x1/BatchNorm/FusedBatchNorm"
  top: "convB1_2_7x1_relu"
}

layer {
  name: "InceptB1"
  type: "Concat"
  bottom: "convB1_1_1x1_relu"
  bottom: "convB1_2_7x1_relu"
  top: "InceptB1"
}

layer {
  name: "InceptionResnetV1/Repeat_1/block17_1/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "InceptB1"
  top: "InceptionResnetV1/Repeat_1/block17_1/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 896
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }

  }
}

layer{
     name: "BiasB1"
     type: "Bias"
     bottom: "InceptionResnetV1/Repeat_1/block17_1/Conv2d_1x1/Conv2D"
     top: "BiasB1"
     }

layer{
  name: "MultB1"
  type: "Power"
  bottom: "BiasB1"
  top: "MultB1"
  power_param {
    power: 1
    scale: 0.10000
  }
}

layer {
  name: "ADDB1"
  type: "Eltwise"
  bottom: "MultB1"
  bottom: "grid_17x17"
  top: "ADDB1"
  eltwise_param {
   operation: SUM 
}
}

layer {
  name: "InceptB1_relu"
  type: "ReLU"
  bottom: "ADDB1"
  top: "InceptB1_relu"
}

#Inception B2

layer {
  name: "InceptionResnetV1/Repeat_1/block17_2/Branch_0/Conv2d_1x1/Conv2D"
  type: "Convolution"
  bottom: "InceptB1_relu"
  top: "InceptionResnetV1/Repeat_1/block17_2/Branch_0/Conv2d_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
  }
}

layer {
  name: "InceptionResnetV1/Repeat_1/block17_2/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  type: "BatchNorm"
  bottom: "InceptionResnetV1/Repeat_1/block17_2/Branch_0/Conv2d_1x1/Conv2D"
  top: "InceptionResnetV1/Repeat_1/block17_2/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.001
  }
}

layer {
  name: "convB2_1_1x1_relu"
  type: "ReLU"
  bottom: "InceptionResnetV1/Repeat_1/block17_2/Branch_0/Conv2d_1x1/BatchNorm/FusedBatchNorm"
  top: "convB2_1_1x1_relu"
}

layer {
  name: "InceptionResnetV1/Repeat_1/block17_2/Branch_1/Conv2d_0a_1x1/Conv2D"
  type: "Convolution"
  bottom: "InceptB1_relu"
  top: "InceptionResnetV1/Repeat_1/block17_2/Branch_1/Conv2d_0a_1x1/Conv2D"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 128
